app/controllers/techniques_controller.rb

  def user_index
    @techniques = Technique.where(user_id: params[:user_id])
---
SELECT "techniques".* FROM "techniques" WHERE "techniques"."user_id" = $1  [["user_id", nil]]

  def user_show
    @technique = Technique.where(user_id: params[:user_id], name: params[:name])
---
SELECT "techniques".* FROM "techniques" WHERE "techniques"."user_id" = $1 AND "techniques"."name" = $2  [["user_id", 5], ["name", "armbar"]]

  def create
    @technique = Technique.new(technique_params)
    @technique.user = @current_user

    if @technique.save
---
INSERT INTO "techniques" ("name", "category", "position", "orientation", "times_executed", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def update
    if @technique.update(technique_params)
---
UPDATE "techniques" SET "times_executed" = $1, "updated_at" = $2 WHERE "techniques"."id" = $3  [["times_executed", 2], ["updated_at", "2020-10-05 17:39:09.792276"], ["id", 11]]

  def set_technique
    @technique = @current_user.techniques.find(params[:id])
---
SELECT "techniques".* FROM "techniques" WHERE "techniques"."user_id" = $1 AND "techniques"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 11], ["LIMIT", 1]]