app/controllers/training_sessions_controller.rb

SELECT "training_sessions".* FROM "training_sessions"
---
  def index
    @training_sessions = Training_Session.all

SELECT "training_sessions".* FROM "training_sessions" WHERE "training_sessions"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @training_session = Training_Session.find(params[:id])