app/controllers/training_sessions_controller.rb

  def user_index
    @training_sessions = TrainingSession.where(user_id: params[:user_id])
---
SELECT "training_sessions".* FROM "training_sessions" WHERE "training_sessions"."user_id" = $1  [["user_id", 7]]

  def user_show
    @training_session = TrainingSession.where(user_id: params[:user_id], id: params[:id])
---
SELECT "training_sessions".* FROM "training_sessions" WHERE "training_sessions"."user_id" = $1 AND "training_sessions"."id" = $2  [["user_id", 7], ["id", 4]]

  def create
    @training_session = TrainingSession.new(training_session_params)
    @training_session.user = @current_user

    if @training_session.save
---
INSERT INTO "training_sessions" ("rolls", "opponents", "subs", "taps", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["rolls", 2], ["opponents", 2], ["subs", 2], ["taps", 2], ["created_at", "2020-10-06 00:57:47.591621"], ["updated_at", "2020-10-06 00:57:47.591621"], ["user_id", 1]]

  def set_training_session
    @training_session = @current_user.training_session.find(params[:id])
---
SELECT "training_sessions".* FROM "training_sessions" WHERE "training_sessions"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]